# Arch install packages

amd-ucode 
base
base-devel
cmake
dosfstools
efibootmgr
linux
linux-firmware
linux-headers
linux-lts
linux-lts-headers
networkmanager
lvm2
man-db
man-pages
mtools
openssh
os-prober
pacman-contrib
paru
paru-debug
reflector
sudo
grub
texinfo
mkinitcpio-firmware # https://wiki.archlinux.org/title/Mkinitcpio#Possibly_missing_firmware_for_module_XXXX


# Linux sound system
alsa-firmware
alsa-utils
libpipewire
pipewire
pipewire-alsa
pipewire-audio
pipewire-jack
pipewire-pulse
wireplumber
rtkit # https://archlinux.org/packages/extra/x86_64/rtkit/

systemctl --user enable --now wireplumber.service pipewire.socket pipewire-pulse.socket


# Nvidia drivers

lib32-nvidia-utils
nvidia
nvidia-lts
nvidia-utils

# Terminal setup

zsh
zsh-completions
fontconfig
ghostty
ttf-firacode-nerd
starship

# Wayland and Hyprland

hyprland
qt5-wayland
qt6-wayland
uwsm

# Neovim and tools

wl-clipboard
neovim
ripgrep
fd
nodejs
npm
tree-sitter-cli



git
librewolf-bin
local-rust-stub
tofi
wget
zellij
bat
